<template><div><h1>前端</h1>
<h2>前端概述</h2>
<p>一直以来，对前端一直是一个笼统的概念，于是，专门花时间整合了网上各种说法，给自己一个较正确的定位。</p>
<p>前端是什么？？
前端，也称web前端。对于网站来说，通常是指网站的前台部分，包括网站的表现层和结构层（通俗点就是用户可以看到的部分）。
总结一下，浏览器、APP、应用程序的界面展现和用户交互就是前端</p>
<p>前端能干什么？？
前端工程师，别称web前端开发攻城狮，是在2005年由淘宝发明出来的称呼。前端工程师通过前端技术完成界面设计（听说大公司分工较明细，这部分交给设计师）,界面制作，用户交互，网站维护、网站优化等等。
通俗点讲，可以设计、制作网页，给网页加上各种各样的特效和功能。</p>
<p>前端需要学会哪些技术？
基础：html+css+javascript,html5+css3
进阶：各种框架，如Bootstrap,jquery,react,vue,angular等等
其他：http,一门后端语言，网站优化等等</p>
<p><img src="@source/MyBlog/images/logo.png" alt=""></p>
</div></template>
